# Pandas DataFrame drop duplicates

In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({"Name":["Archana","Mani","Thiru","Kalpana"]})

In [3]:
data

      Name
0  Archana
1     Mani
2    Thiru
3  Kalpana

In [4]:
data["Age"] = [23,23,34,12]

In [5]:
data

      Name  Age
0  Archana   23
1     Mani   23
2    Thiru   34
3  Kalpana   12

In [6]:
# Now I am adding one duplicate name of same name

In [15]:
data = pd.DataFrame({"Name":["Archana","Archana","Thiru","Kalpana","Kalpana"]})

In [16]:
data

      Name
0  Archana
1  Archana
2    Thiru
3  Kalpana
4  Kalpana

In [17]:
data["Age"] = [23,23,34,22,22]

In [18]:
data

      Name  Age
0  Archana   23
1  Archana   23
2    Thiru   34
3  Kalpana   22
4  Kalpana   22

In [19]:
type(data)

pandas.core.frame.DataFrame

In [20]:
data.drop_duplicates() # These remove the duplicates

      Name  Age
0  Archana   23
2    Thiru   34
3  Kalpana   22

In [21]:
data["City"] = ["Salem","Salem","Madurai","Nellai","Erode"]

In [22]:
data

      Name  Age     City
0  Archana   23    Salem
1  Archana   23    Salem
2    Thiru   34  Madurai
3  Kalpana   22   Nellai
4  Kalpana   22    Erode

In [23]:
data.drop_duplicates()

      Name  Age     City
0  Archana   23    Salem
2    Thiru   34  Madurai
3  Kalpana   22   Nellai
4  Kalpana   22    Erode

In [25]:
# See here, only Archana got removed. Bcoz Kalpana has 2 different city names called Nellai,Erode

In [26]:
data.drop_duplicates?

Signature:
data.drop_duplicates(
    subset: 'Hashable | Sequence[Hashable] | None' = None,
    keep: "Literal['first'] | Literal['last'] | Literal[False]" = 'first',
    inplace: 'bool' = False,
    ignore_index: 'bool' = False,
) -> 'DataFrame | None'
Docstring:
Return DataFrame with duplicate rows removed.

Considering certain columns is optional. Indexes, including time indexes
are ignored.

Parameters
----------
subset : column label or sequence of labels, optional
    Only consider certain columns for identifying duplicates, by
    default use all of the columns.
keep : {'first', 'last', False}, default 'first'
    Determines which duplicates (if any) to keep.
    - ``first`` : Drop duplicates except for the first occurrence.
    - ``last`` : Drop duplicates except for the last occurrence.
    - False : Drop all duplicates.
inplace : bool, default False
    Whether to drop duplicates in place or to return a copy.
ignore_index : bool, default False
    If True, the resulting axis will be labeled 0, 1, …, n - 1.

    .. versionadded:: 1.0.0

Returns
-------
DataFrame or None
    DataFrame with duplicates removed or None if ``inplace=True``.

See Also
--------
DataFrame.value_counts: Count unique combinations of columns.

Examples
--------
Consider dataset containing ramen rating.

>>> df = pd.DataFrame({
...     'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
...     'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
...     'rating': [4, 4, 3.5, 15, 5]
... })
>>> df
    brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

By default, it removes duplicate rows based on all columns.

>>> df.drop_duplicates()
    brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

To remove duplicates on specific column(s), use ``subset``.

>>> df.drop_duplicates(subset=['brand'])
    brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5

To remove duplicates and keep last occurrences, use ``keep``.

>>> df.drop_duplicates(subset=['brand', 'style'], keep='last')
    brand style  rating
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
4  Indomie  pack     5.0

In [27]:
data.drop_duplicates(subset=["Name","Age"])

      Name  Age     City
0  Archana   23    Salem
2    Thiru   34  Madurai
3  Kalpana   22   Nellai

In [28]:
# Bcoz this will consider only Name and Age. So duplicates are removed correctly without thinking about City

In [29]:
# keep attribute will consider the occurances. If keep="last" means, it takes kalpana of last occurances

In [30]:
data.drop_duplicates(subset=["Name","Age"], keep="last")

      Name  Age     City
1  Archana   23    Salem
2    Thiru   34  Madurai
4  Kalpana   22    Erode

In [31]:
# So now based on that last occurance, Kalpana with Erode is considered.

In [32]:
# Subset and keep are the important attributes

In [33]:
# If keep not given means, it takes always 1st occurances.